RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
        xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
        s_sd_slow_buffer->clear();

#ifdef PROFILE_CAMERA_DATA
        s_profiler.set(PF_CAMERA_SD_SLOW_BUF, 0 );
#endif

        xSemaphoreGive(s_sd_slow_buffer_mux);

        bool error = false; 
        bool done = false;
        bool syncFrameStart = true;
        int offset = 0;

        while (!done)
        {
            ulTaskNotifyTake(pdTRUE, 1000 / portTICK_PERIOD_MS); //wait for notification

            while (true) //consume all the buffer
            {
                if (!s_air_record)
                {
                    LOG("Done recording, closing file\n", s_sd_file_size);
                    done = true;
                    break;
                }

                if ( s_shouldRestartRecording != 0) 
                {
                    done = true;
                    break;
                }

                int len = SD_WRITE_BLOCK_SIZE - offset;

                xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
                bool read = s_sd_slow_buffer->read(&(sd_write_block[offset]), len);
#ifdef PROFILE_CAMERA_DATA    
                s_profiler.set(PF_CAMERA_SD_SLOW_BUF, s_sd_slow_buffer->size() / (SD_SLOW_BUFFER_SIZE_PSRAM / 100 ));
#endif
                xSemaphoreGive(s_sd_slow_buffer_mux);
                if (!read)
                {
                    break; //not enough data, wait
                }

                if ( syncFrameStart )
                {
                    while ( (len >= 3) && ((sd_write_block[offset] != 0xff) || (sd_write_block[offset+1] != 0xd8) || (sd_write_block[offset+2] != 0xff))) 
                    {
                        offset++;
                        len--;
                    }

                    if ( len < 3 ) 
                    {
                        offset = 0;
                        continue;
                    }
                    else
                    {
                        //LOG("Sync = %d %d 0x%02x 0x%02x\n", offset, len, (int)sd_write_block[offset], (int)sd_write_block[offset+1]);
                        syncFrameStart = false;
                        if ( offset > 0 )
                        {
                            memcpy(sd_write_block, sd_write_block+offset, len);
                            offset = len;
                            continue;
                        }
                    }
                }

                offset = 0;
                
                if (write(fd, sd_write_block, SD_WRITE_BLOCK_SIZE) < 0 )
                {
                    LOG("Error while writing! Stopping session\n");
                    done = true;
                    error = true;
                    SDError = true;
                    break;
                }
                s_stats.sd_data += SD_WRITE_BLOCK_SIZE;
                s_sd_file_size += SD_WRITE_BLOCK_SIZE;
                if (s_sd_file_size > 50 * 1024 * 1024)
                {
                    LOG("Max file size reached: %d. Restarting session\n", s_sd_file_size);
                    done = true;
                    break;
                }
            }  //while true -consume all buffer
        }  //while !done

        if (!error)
        {
            fsync(fd);
            close(fd);

            updateSDInfo();
        }
        else
        {
            s_air_record = false;
            //shutdown_sd();
        }
    }
}
#else

//=============================================================================================
//=============================================================================================
//this will write data from the slow queue to AVI file
static void sd_write_proc(void*)
{
    //for fast SD writes, buffer has to be in DMA enabled memory
    uint32_t blockSize = 0;

    while (true)
    {
        if (!s_air_record)
        {
            vTaskDelay(1000 / portTICK_PERIOD_MS);
            continue;
        }

        int fd = open_sd_file();
        if ( fd == -1)
        {
            s_air_record = false;
            SDError = true;
            vTaskDelay(1000 / portTICK_PERIOD_MS); 
            continue;
        }

        bool error = false; 
        bool done = false;
        blockSize = 0;
        while (!done)
        {
            ulTaskNotifyTake(pdTRUE, 1000 / portTICK_PERIOD_MS); //wait for notification

            if (!s_air_record)
            {
                LOG("Done recording, closing file\n", s_sd_file_size);
                done = true;
                continue;
            }

            //for simplification of parsing, 
            //wait untill buffer is filled at least to 300kb to ensure that we have one jpeg in buffer for sure
            xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
            bool hasEnoughData = s_sd_slow_buffer->size() >= MAX_JPEG_LOOKAHEAD;
            xSemaphoreGive(s_sd_slow_buffer_mux);

            if (!hasEnoughData) continue;

            JpegInfo info;
            if ( find_jpeg_in_buffer1(*s_sd_slow_buffer, MAX_JPEG_LOOKAHEAD, &info) == 0 )
            {

                LOG("Frame %d %d %d %d\n", info.offset, info.size, info.width, info.height);

                xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
                s_sd_slow_buffer->skip(info.offset);
                xSemaphoreGive(s_sd_slow_buffer_mux);

                size_t count = info.size;
                while (count > 0 )
                {
                    size_t len = std::min<size_t>(count, SD_WRITE_BLOCK_SIZE - blockSize);
                    
                    xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
                    s_sd_slow_buffer->read( sd_write_block + blockSize, len);
                    xSemaphoreGive(s_sd_slow_buffer_mux);
                    count -= len;
                    blockSize += len;

                    if (blockSize == SD_WRITE_BLOCK_SIZE)
                    {
                        if (write(fd, sd_write_block, SD_WRITE_BLOCK_SIZE) < 0 )
                        {
                            LOG("Error while writing! Stopping session\n");
                            done = true;
                            error = true;
                            SDError = true;
                            break;
                        }
                        blockSize = 0;
                        s_stats.sd_data += SD_WRITE_BLOCK_SIZE;
                    }
                }

                if (done) break;
            }
            else
            {
                LOG("Skipping \n");

