RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
                xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
                s_sd_slow_buffer->skip(MAX_JPEG_LOOKAHEAD);
                xSemaphoreGive(s_sd_slow_buffer_mux);
            }
        }
        
        if (!error)
        {
            fsync(fd);
            close(fd);

            updateSDInfo();
        }
        else
        {
            s_air_record = false;
            //shutdown_sd();
        }
    }
}


#endif


//=============================================================================================
//=============================================================================================
//this will move data from the fast queue to the slow queue
static void sd_enqueue_proc(void*)
{
    while (true)
    {
        if (!s_air_record)
        {
            //vTaskDelay(1000 / portTICK_PERIOD_MS);
            ulTaskNotifyTake(pdTRUE, 1000 / portTICK_PERIOD_MS); //wait for notification
            continue;
        }

        xSemaphoreTake(s_sd_fast_buffer_mux, portMAX_DELAY);
        s_sd_fast_buffer.clear();

#ifdef PROFILE_CAMERA_DATA    
        s_profiler.set(PF_CAMERA_SD_FAST_BUF, 0);
#endif
        xSemaphoreGive(s_sd_fast_buffer_mux);

        while (true)
        {
            ulTaskNotifyTake(pdTRUE, 1000 / portTICK_PERIOD_MS); //wait for notification

            xSemaphoreTake(s_sd_fast_buffer_mux, portMAX_DELAY);
            size_t size = s_sd_fast_buffer.size();
            if (size == 0)
            {
                xSemaphoreGive(s_sd_fast_buffer_mux);
                continue; //no data? wait some more
            }

            const void* buffer = s_sd_fast_buffer.start_reading(size);
            xSemaphoreGive(s_sd_fast_buffer_mux);

            xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
            if ( !s_sd_slow_buffer->write(buffer, size) )
            {
                s_stats.sd_drops += size;
#ifdef PROFILE_CAMERA_DATA    
                s_profiler.toggle(PF_CAMERA_SD_OVF );
#endif
            }

#ifdef PROFILE_CAMERA_DATA    
            s_profiler.set(PF_CAMERA_SD_SLOW_BUF, s_sd_slow_buffer->size() / (SD_SLOW_BUFFER_SIZE_PSRAM / 100));
#endif

            xSemaphoreGive(s_sd_slow_buffer_mux);

            xSemaphoreTake(s_sd_fast_buffer_mux, portMAX_DELAY);
            s_sd_fast_buffer.end_reading(size);

#ifdef PROFILE_CAMERA_DATA    
            s_profiler.set(PF_CAMERA_SD_FAST_BUF, s_sd_fast_buffer.size() / (SD_FAST_BUFFER_SIZE / 100));
#endif

            xSemaphoreGive(s_sd_fast_buffer_mux);

            if (s_sd_write_task)
                xTaskNotifyGive(s_sd_write_task); //notify task

            if (!s_air_record)
                break;
        }
    }
}

IRAM_ATTR static void add_to_sd_fast_buffer(const void* data, size_t size)
{
    xSemaphoreTake(s_sd_fast_buffer_mux, portMAX_DELAY);
    bool ok = s_sd_fast_buffer.write(data, size);

#ifdef PROFILE_CAMERA_DATA    
    s_profiler.set(PF_CAMERA_SD_FAST_BUF, s_sd_fast_buffer.size() / (SD_FAST_BUFFER_SIZE / 100) );
#endif

    xSemaphoreGive(s_sd_fast_buffer_mux);
    if (ok)
    {
        if (s_sd_enqueue_task)
            xTaskNotifyGive(s_sd_enqueue_task); //notify task
    }
    else
    {
        s_stats.sd_drops += size;
#ifdef PROFILE_CAMERA_DATA    
        s_profiler.toggle(PF_CAMERA_SD_OVF);
#endif
    }
}

#endif

//=============================================================================================
//=============================================================================================
IRAM_ATTR void packet_received_cb(void* buf, wifi_promiscuous_pkt_type_t type)
{
    if (type == WIFI_PKT_MGMT)
    {
        //LOG("management packet\n");
        s_stats.inRejectedPacketCounter++;
        return;
    }
    else if (type == WIFI_PKT_DATA)
    {
        //LOG("data packet\n");
    }
    else if (type == WIFI_PKT_MISC)
    {
        //LOG("misc packet\n");
        s_stats.inRejectedPacketCounter++;
        return;
    }

    wifi_promiscuous_pkt_t *pkt = reinterpret_cast<wifi_promiscuous_pkt_t*>(buf);

    uint16_t len = pkt->rx_ctrl.sig_len;
    //s_stats.wlan_data_received += len;
    //s_stats.wlan_data_sent += 1;

    if (len <= WLAN_IEEE_HEADER_SIZE)
    {
        LOG("WLAN receive header error");
        s_stats.wlan_error_count++;
        return;
    }

    //LOG("Recv %d bytes\n", len);
    //LOG("Channel: %d\n", (int)pkt->rx_ctrl.channel);

    //uint8_t broadcast_mac[] = { 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF };
    //LOG("MAC: %02x:%02x:%02x:%02x:%02x:%02x\n", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    uint8_t *data = pkt->payload;
    if (memcmp(data + 10, WLAN_IEEE_HEADER_GROUND2AIR + 10, 6) != 0)
    {
        s_stats.inRejectedPacketCounter++;
        return;
    }

    data += WLAN_IEEE_HEADER_SIZE;
    len -= WLAN_IEEE_HEADER_SIZE; //skip the 802.11 header

    len -= 4; //the received length has 4 more bytes at the end for some reason.

    s_stats.inPacketCounter++;
    s_stats.rssiDbm = -pkt->rx_ctrl.rssi;
    s_stats.noiseFloorDbm = -pkt->rx_ctrl.noise_floor;

    size_t size = std::min<size_t>(len, WLAN_MAX_PAYLOAD_SIZE);

    s_fec_decoder.lock();
    if (!s_fec_decoder.decode_data(data, size, false))
        s_stats.wlan_received_packets_dropped++;
    s_fec_decoder.unlock();

    s_stats.wlan_data_received += len;
}

//=============================================================================================
//=============================================================================================
//process settings not related to camera sensor setup
IRAM_ATTR static void handle_ground2air_config_packetEx1(Ground2Air_Config_Packet& src)
{
    s_recv_ground2air_packet = true;

    int64_t t = esp_timer_get_time();
    int64_t dt = t - s_last_seen_config_packet;
    s_last_seen_config_packet = t;

    Ground2Air_Config_Packet& dst = s_ground2air_config_packet;

    bool newSession = false;
    if (dst.sessionId != src.sessionId)
    {
        dst.sessionId = src.sessionId;
        dst.air_record_btn = src.air_record_btn;
        dst.profile1_btn = src.profile1_btn;
        dst.profile2_btn = src.profile2_btn;
    }

    if (dst.wifi_rate != src.wifi_rate)
    {
        LOG("Wifi rate changed from %d to %d\n", (int)dst.wifi_rate, (int)src.wifi_rate);
        ESP_ERROR_CHECK(set_wifi_fixed_rate(src.wifi_rate));
    }
    if (dst.wifi_power != src.wifi_power)
    {
        LOG("Wifi power changed from %d to %d\n", (int)dst.wifi_power, (int)src.wifi_power);
        ESP_ERROR_CHECK(set_wlan_power_dBm(src.wifi_power));
    }
    if (dst.fec_codec_n != src.fec_codec_n)
    {
        LOG("FEC codec changed from %d/%d/%d to %d/%d/%d\n", (int)dst.fec_codec_k, (int)dst.fec_codec_n, (int)dst.fec_codec_mtu, (int)src.fec_codec_k, (int)src.fec_codec_n, (int)src.fec_codec_mtu);
        {
            s_fec_encoder.switch_n( src.fec_codec_n );
        }
    }
    if (dst.wifi_channel != src.wifi_channel)
    {
        LOG("Wifi channel changed from %d to %d\n", (int)dst.wifi_channel, (int)src.wifi_channel);
        nvs_args_set("channel", src.wifi_channel);
        ESP_ERROR_CHECK(esp_wifi_set_channel((int)src.wifi_channel, WIFI_SECOND_CHAN_NONE));

        //s_air_record = false;
        //s_restart_time = esp_timer_get_time() + 2000000;
    }

    if (dst.camera.fps_limit != src.camera.fps_limit)
    {
        if (src.camera.fps_limit == 0)
            s_video_target_frame_dt = 0;
        else
            s_video_target_frame_dt = 1000000 / src.camera.fps_limit;
        LOG("Target FPS changed from %d to %d\n", (int)dst.camera.fps_limit, (int)src.camera.fps_limit);
    }

    if ( s_restart_time == 0 )
    {
        if ( dst.air_record_btn != src.air_record_btn )
        {
            s_air_record = !s_air_record;
            dst.air_record_btn = src.air_record_btn;
        }

#if defined(ENABLE_PROFILER)
        if ( dst.profile1_btn != src.profile1_btn )
        {
            if ( s_profiler.isActive())
            {
                LOG("Profiler stopped!\n");
                s_profiler.stop();
                s_profiler.save();
                s_profiler.clear();
            }
            else
            {
                LOG("Profiler started!\n");
                s_profiler.start(500);
            }
            dst.profile1_btn = src.profile2_btn;
        }

        if ( dst.profile2_btn != src.profile2_btn )
        {
            if ( s_profiler.isActive())
            {
                LOG("Profiler stopped!\n");
                s_profiler.stop();
                s_profiler.save();
                s_profiler.clear();
            }
            else
            {
                LOG("Profiler started!\n");
                s_profiler.start(3000);
            }
            dst.profile2_btn = src.profile2_btn;
        }
#endif
    }

    dst = src;
}

//=============================================================================================
//=============================================================================================
//process settings related to camera sensor setup
IRAM_ATTR void handle_ground2air_config_packetEx2(bool forceCameraSettings)
{
    Ground2Air_Config_Packet& src = s_ground2air_config_packet;
    Ground2Air_Config_Packet& dst = s_ground2air_config_packet2;

#ifdef SENSOR_OV5640
    //on ov5640, aec2 is not aec dsp but "night vision" mode which decimate framerate dynamically
    src.camera.aec2 = false;
#endif

