RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    size_t freeSize = 0;
    ESP_ERROR_CHECK( uart_get_tx_buffer_free_size(UART_MAVLINK, &freeSize) );

    if ( freeSize >= s )
    {
        uart_write_bytes(UART_MAVLINK, ((uint8_t*)&src) + sizeof(Ground2Air_Header), s);
        //uart_write_bytes(UART_NUM_0, ((uint8_t*)&src) + sizeof(Ground2Air_Header), s);
    }

    xSemaphoreGive(s_serial_mux);
#endif
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR void send_air2ground_video_packet(bool last)
{
    if (last)
        s_stats.video_frames++;
    s_stats.video_data += s_video_frame_data_size;

    uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true);

    if(!packet_data){
        LOG("no data buf!\n");
        return ;
    }

    Air2Ground_Video_Packet& packet = *(Air2Ground_Video_Packet*)packet_data;
    packet.type = Air2Ground_Header::Type::Video;
    packet.resolution = s_ground2air_config_packet.camera.resolution;
    packet.frame_index = s_video_frame_index;
    packet.part_index = s_video_part_index;
    packet.last_part = last ? 1 : 0;
    packet.size = s_video_frame_data_size + sizeof(Air2Ground_Video_Packet);
    packet.pong = s_ground2air_config_packet.ping;
    packet.version = PACKET_VERSION;
    packet.crc = 0;
    packet.crc = crc8(0, &packet, sizeof(Air2Ground_Video_Packet));
    if (!s_fec_encoder.flush_encode_packet(true))
    {
        LOG("Fec codec busy\n");
        s_stats.wlan_error_count++;
#ifdef PROFILE_CAMERA_DATA    
        s_profiler.toggle(PF_CAMERA_FEC_OVF);
#endif
    }
}

#ifdef UART_MAVLINK
//=============================================================================================
//=============================================================================================
IRAM_ATTR void send_air2ground_data_packet()
{
    int avail = MAX_TELEMETRY_PAYLOAD_SIZE - s_mavlinkOutBufferCount;
    if ( avail > 0 )
    {
        size_t rs;
        ESP_ERROR_CHECK( uart_get_buffered_data_len(UART_MAVLINK, &rs) );
        if ( rs > avail ) rs = avail;

        if ( rs > 0 )
        {
            int len = uart_read_bytes(UART_MAVLINK, &(s_mavlink_out_buffer[s_mavlinkOutBufferCount]),rs, 0);
            if ( len < 0 )
            {
                LOG("MAVLNK COM error\n");
            }
            else
            {
                s_mavlinkOutBufferCount += len;
            }
        }
    }

    if ( s_mavlinkOutBufferCount < MAX_TELEMETRY_PAYLOAD_SIZE ) return; //todo: or agregationtime

    uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true);
    if(!packet_data)
    {
        LOG("no data buf!\n");
        return;
    }

    Air2Ground_Data_Packet& packet = *(Air2Ground_Data_Packet*)packet_data;
    packet.type = Air2Ground_Header::Type::Telemetry;
    packet.size = s_mavlinkOutBufferCount + sizeof(Air2Ground_Data_Packet);
    packet.pong = s_ground2air_config_packet.ping;
    packet.version = PACKET_VERSION;
    packet.crc = 0;
    packet.crc = crc8(0, &packet, sizeof(Air2Ground_Data_Packet));

    memcpy( packet_data + sizeof(Air2Ground_Data_Packet), s_mavlink_out_buffer, s_mavlinkOutBufferCount );

    if (!s_fec_encoder.flush_encode_packet(true))
    {
        LOG("Fec codec busy\n");
        s_stats.wlan_error_count++;
#ifdef PROFILE_CAMERA_DATA
        s_profiler.toggle(PF_CAMERA_FEC_OVF);
#endif
    }
    else
    {
        s_stats.out_telemetry_data += s_mavlinkOutBufferCount;
        s_mavlinkOutBufferCount = 0;
    }
}
#endif

//=============================================================================================
//=============================================================================================
IRAM_ATTR void send_air2ground_osd_packet()
{
    uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true);

    if(!packet_data){
        LOG("no data buf!\n");
        return ;
    }

    Air2Ground_OSD_Packet& packet = *(Air2Ground_OSD_Packet*)packet_data;
    packet.type = Air2Ground_Header::Type::OSD;
    packet.size = sizeof(Air2Ground_OSD_Packet);
    packet.pong = s_ground2air_config_packet.ping;
    packet.version = PACKET_VERSION;
    packet.crc = 0;

#ifdef DVR_SUPPORT
    packet.stats.SDDetected = s_sd_initialized ? 1: 0;
    packet.stats.SDSlow = s_last_stats.sd_drops ? 1: 0;
    packet.stats.SDError = SDError ? 1: 0;
#else
    packet.stats.SDDetected = 0;
    packet.stats.SDSlow = 0;
    packet.stats.SDError = 0;
#endif    
    packet.stats.curr_wifi_rate = (uint8_t)s_wlan_rate;

    packet.stats.wifi_queue_min = s_min_wlan_outgoing_queue_usage_seen;
    packet.stats.wifi_queue_max = s_max_wlan_outgoing_queue_usage;
    packet.stats.air_record_state = s_air_record ? 1 : 0;

    packet.stats.wifi_ovf = 0;
    if ( s_wifi_ovf_time > 0 )
    {
        int64_t t = esp_timer_get_time();
        t -= s_wifi_ovf_time;
        if ( t < 1000000 )
        {
            packet.stats.wifi_ovf = 1;
        }
        else
        {
            s_wifi_ovf_time = 0;
        }
    }
    
    packet.stats.SDFreeSpaceGB16 = SDFreeSpaceGB16;
    packet.stats.SDTotalSpaceGB16 = SDTotalSpaceGB16;
    packet.stats.curr_quality = s_quality;

#ifdef SENSOR_OV5640
    packet.stats.isOV5640 = 1;
#else
    packet.stats.isOV5640 = 0;
#endif    

    packet.stats.outPacketRate = s_last_stats.outPacketCounter;
    packet.stats.inPacketRate = s_last_stats.inPacketCounter;
    packet.stats.inRejectedPacketRate = s_last_stats.inRejectedPacketCounter;
    packet.stats.rssiDbm = s_last_stats.rssiDbm;
    packet.stats.noiseFloorDbm = s_last_stats.noiseFloorDbm;
    packet.stats.captureFPS = s_actual_capture_fps;
    packet.stats.cam_frame_size_min = s_last_stats.camera_frame_size_min;
    packet.stats.cam_frame_size_max = s_last_stats.camera_frame_size_max;
    packet.stats.cam_ovf_count = cam_ovf_count;
    packet.stats.inMavlinkRate = s_last_stats.in_telemetry_data;
    packet.stats.outMavlinkRate = s_last_stats.out_telemetry_data;

    memcpy( &packet.buffer, g_osd.getBuffer(), OSD_BUFFER_SIZE );
    
