RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    packet.crc = crc8(0, &packet, sizeof(Air2Ground_OSD_Packet));

    if (!s_fec_encoder.flush_encode_packet(true))
    {
        LOG("Fec codec busy\n");
        s_stats.wlan_error_count++;
#ifdef PROFILE_CAMERA_DATA    
        s_profiler.toggle(PF_CAMERA_FEC_OVF);
#endif
    }
}

constexpr size_t MAX_VIDEO_DATA_PAYLOAD_SIZE = AIR2GROUND_MTU - sizeof(Air2Ground_Video_Packet);

static const int WifiRateBandwidth[] = 
{
    2*1024*125, // 0 - RATE_B_2M_CCK,
    2*1024*125, // 1 - RATE_B_2M_CCK_S,
    5*1024*125, // 2 - RATE_B_5_5M_CCK,
    5*1024*125, // 3 - RATE_B_5_5M_CCK_S,
    11*1024*125, // 4 - RATE_B_11M_CCK,
    11*1024*125, // 5 - RATE_B_11M_CCK_S,

    6*1024*125, // 6 - RATE_G_6M_ODFM,
    9*1024*125, // 7 - RATE_G_9M_ODFM,
    12*1024*125, // 8 - RATE_G_12M_ODFM,
    18*1024*125, // 9 - RATE_G_18M_ODFM,
    24*1024*125,  // 10 - RATE_G_24M_ODFM,
    36*1024*125,  // 11 - RATE_G_36M_ODFM,
    48*1024*125,  // 12 - RATE_G_48M_ODFM,
    54*1024*125,  // 13 - RATE_G_54M_ODFM,

    6*1024*125, // 14 - RATE_N_6_5M_MCS0,
    7*1024*125, // 15 - RATE_N_7_2M_MCS0_S,
    13*1024*125, // 16 - RATE_N_13M_MCS1,
    14*1024*125, // 17 - RATE_N_14_4M_MCS1_S,
    19*1024*125, // 18 - RATE_N_19_5M_MCS2,
    21*1024*125, // 19 - RATE_N_21_7M_MCS2_S,
    26*1024*125, // 20 - RATE_N_26M_MCS3,
    28*1024*125, // 21 - RATE_N_28_9M_MCS3_S,
    39*1024*125, // 22 - RATE_N_39M_MCS4,
    43*1024*125, // 23 - RATE_N_43_3M_MCS4_S,
    52*1024*125, // 24 - RATE_N_52M_MCS5,
    57*1024*125, // 25 - RATE_N_57_8M_MCS5_S,
    58*1024*125, // 26 - RATE_N_58M_MCS6,
    65*1024*125, // 27 - RATE_N_65M_MCS6_S,
    65*1024*125, // 28 - RATE_N_65M_MCS7,
    72*1024*125 // 29 - RATE_N_72M_MCS7_S,
};


IRAM_ATTR int getBandwidthForRate(WIFI_Rate rate)
{
    return WifiRateBandwidth[(int)rate];
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR int calculateAdaptiveQualityValue()
{
    int quality1 = (int)(8 + (63-8) * ( 1 - s_quality_framesize_K1 * s_quality_framesize_K2 * s_quality_framesize_K3));
    if ( quality1 < 8) quality1 = 8;
    if ( quality1 > 63) quality1 = 63;

    //recode due to non-linear frame size changes depending on quality
    //from 8 to 19 frame size decreases by half, from 20 to 63 frame size decreases by half
    //y=(x-8)^2.3/185 + 8
    static const uint8_t recode[64-8] = { 8, 8, 8, 8, 8, 8, 8, 8, 9, 9, 9, 9, 10, 10, 10, 11, 11, 12, 12, 13, 13, 14, 15, 15, 16, 17, 18, 19, 20, 20, 21, 23, 24, 25, 26, 27, 29, 30, 31, 33, 34, 36, 37, 39, 41, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 63};

    return recode[quality1-8];
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR void recalculateFrameSizeQualityK(int video_full_frame_size)
{
    if ( video_full_frame_size > s_max_frame_size )
    {
        s_max_frame_size = video_full_frame_size;
    }
    if ( video_full_frame_size == 0 ) return;

    int fps = s_actual_capture_fps > 1 ? s_actual_capture_fps : 1;

    //K1 - wifi bandwidth
    //data rate available with current wifi rate
    int rateBandwidth = getBandwidthForRate(s_wlan_rate);

    rateBandwidth = rateBandwidth * 5 / 10;  //assume only  50% of theoretical maximum bandwidth is available in practice

#ifdef BOARD_XIAOS3SENSE        
    //2.9MB/sec is practical maximum limit which works
    if ( rateBandwidth > 2900*1024 ) rateBandwidth = 2900*1024;
#else
    //2.3MB/sec is practical maximum limit which works
    if ( rateBandwidth > 2300*1024 ) rateBandwidth = 2300*1024;
#endif

    //decrease available data rate using FEC codec parameters
    int FECbandwidth = rateBandwidth * s_ground2air_config_packet.fec_codec_k / s_ground2air_config_packet.fec_codec_n;

    if ( s_air_record )
    {
#ifdef BOARD_XIAOS3SENSE        
        //1.9MB/sec is practical maximum SD write speed 
        if ( FECbandwidth > 1900*1024 ) FECbandwidth = 1900*1024;
#else
        //1.9MB/sec is practical maximum SD write speed 
        if ( FECbandwidth > 1900*1024 ) FECbandwidth = 1900*1024;
#endif
    }
    
    int frameSize = FECbandwidth / fps;
    if ( frameSize < 1 ) frameSize = 1;

    float k = frameSize * 1.0f / video_full_frame_size;
    if ( k > 1.1f ) k = 1.1f;

    s_quality_framesize_K1 = s_quality_framesize_K1 * k;
    if ( s_quality_framesize_K1 < 0.05f ) s_quality_framesize_K1 = 0.05f;
    if ( s_quality_framesize_K1 > 1.0f ) s_quality_framesize_K1 = 1.0f;


    //k2 - max frame size which do not overload wifi output queue
    //wifi output queue should have space to hold frame data and fec data
    int safe_frame_size = WLAN_OUTGOING_BUFFER_SIZE *  s_ground2air_config_packet.fec_codec_k / s_ground2air_config_packet.fec_codec_n;
    //queue is emptied by tx thread constantly so we can assume virtually "larger buffer"
    safe_frame_size += FECbandwidth / fps; 
    safe_frame_size = safe_frame_size * 7 / 10;  //assume next frame can suddenly increase is size by 30%
    if ( video_full_frame_size > safe_frame_size )
    {
        s_quality_framesize_K2 -= (video_full_frame_size - safe_frame_size) / 100000.0f;// * 30 / fps;
    }
    else
    {
        s_quality_framesize_K2 += ( safe_frame_size - video_full_frame_size ) / 1000000.0f;// * 30 / fps;
    }
    if ( s_quality_framesize_K2 < 0.05f ) s_quality_framesize_K2 = 0.05f;
    if ( s_quality_framesize_K2 > 1.0f ) s_quality_framesize_K2 = 1.0f;


    /*
    s_quality_framesize_K2 = s_quality_framesize_K2 * safe_frame_size * 1.0f / video_full_frame_size;
    if ( s_quality_framesize_K2 < 0.05f ) s_quality_framesize_K2 = 0.05f;
    if ( s_quality_framesize_K2 > 1.0f ) s_quality_framesize_K2 = 1.0f;
    */

    //K3 - wifi queue

    if ( (s_stats.wlan_error_count > 0) || (s_fec_spin_count > 0) || (s_fec_wlan_error_count > 0))
    {
        s_quality_framesize_K3 = 0; //we overloaded wifi buffer. drop quality immediatelly, we do not want to loose more frames
    }

    int min_wlan_outgoing_queue_usage_frame = getMinWlanOutgoingQueueUsageFrame(); //get the minimum wifi queue usage while sending frame

    //keep max wifi out queue usage below 80%
    //keep min wifi out queue usage in range 0...10%
    int max_wlan_outgoing_queue_usage_frame = getMaxWlanOutgoingQueueUsageFrame(); //get the maximum wifi queue usage while sending frame 
    if ( min_wlan_outgoing_queue_usage_frame > 10 )
    {
        s_quality_framesize_K3 -= (min_wlan_outgoing_queue_usage_frame - 10) / 100.0f;
        //make sure quality is dropped at least by 1 point
        while ( s_quality_framesize_K3 > 0 )
        {
            int quality1 = calculateAdaptiveQualityValue();
            if ( quality1 > s_quality ) break;
            s_quality_framesize_K3 -= 0.01;
        }
    }
    else if ( max_wlan_outgoing_queue_usage_frame > 80 )
    {
        s_quality_framesize_K3 -= (max_wlan_outgoing_queue_usage_frame - 60) / 100.0f;
    }
    else 
    {
        s_quality_framesize_K3 += ( 40 - max_wlan_outgoing_queue_usage_frame ) / 10000.0f;
    }
    if ( s_quality_framesize_K3 < 0) s_quality_framesize_K3 = 0;
    else if ( s_quality_framesize_K3 > 1) s_quality_framesize_K3 = 1;
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR void applyAdaptiveQuality()
{
    if ( s_ground2air_config_packet.camera.quality != 0 ) return;

    int quality1 = calculateAdaptiveQualityValue();

